000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500     77 X PIC 99.
000600     77 Y PIC 99.
000700     77 Z PIC 99.
000800 PROCEDURE DIVISION.
000900     SET X TO 10.
001000     SET Y TO 25.
001100     ADD X Y GIVING Z.
001200     DISPLAY "X + Y = " Z "."
001300     STOP RUN.